{
	"version": "https://jsonfeed.org/version/1",
	"title": "Lukas Rosenstock",
	"home_page_url": "https://lukasrosenstock.net/",
	"feed_url": "https://lukasrosenstock.net/feed.json",
	"items": [
		
		{
			"id": "http://lukas.micro.blog/2018/06/21/im-back-home.html",
	      	
			"content_html": "<p>I’m back home in Germany after my two-week workation in Gran Canaria. These two weeks were a great experience but also way too short; as I had a lot of work to do I couldn’t explore as much of the city or the island as I wanted to. So, sooner or later, I have to go there again!</p>\n",
			"date_published": "2018-06-21T16:39:11+02:00",
			"url": "https://lukasrosenstock.net/2018/06/21/im-back-home.html"
		},
		
		{
			"id": "http://lukas.micro.blog/2018/06/11/i-saw-the.html",
	      	
			"content_html": "<p>I saw the documentary <a href=\"https://www.imdb.com/title/tt5033790/?ref_=nv_sr_1\">Banking on Bitcoin</a> last night. The main reason I watched it was that they hosted a screening at this very nice co-working/co-living place called <a href=\"http://theroof.io/\">The Roof</a> here in Las Palmas. \nRegarding the movie itself, it’s obviously outdated since it’s from 2016 and a lot has happened in the cryptocurrency space since then.</p>\n\n<p><em>What I liked about it</em>: it does a good job demonstrating the beginnings of Bitcoin from the cypherpunk movement, the first startups in the space and their regulation issues as well as the search for the identity of Satoshi Nakamoto. From that perspective, I can highly recommend it.</p>\n\n<p><em>What I didn’t like about it:</em> the movie contains practically no criticism. Issues like scalability are glossed over, and others like the inefficient use of energy are not mentioned at all. You end up thinking that Bitcoin is without a doubt this great technology that just has to go through growing pains.</p>\n",
			"date_published": "2018-06-11T16:58:58+02:00",
			"url": "https://lukasrosenstock.net/2018/06/11/i-saw-the.html"
		},
		
		{
			"id": "http://lukas.micro.blog/2018/06/06/i-arrived-in.html",
	      	
			"content_html": "<p>I arrived in Las Palmas de Gran Canaria today! For the next two weeks I will be working from the lovely <a href=\"http://restation.co/\">ReStation co-working space</a> and enjoy my free time exploring the city and the beach.</p>\n",
			"date_published": "2018-06-06T22:07:42+02:00",
			"url": "https://lukasrosenstock.net/2018/06/06/i-arrived-in.html"
		},
		
		{
			"id": "http://lukas.micro.blog/2018/06/05/ive-written-and.html",
	      	
			"content_html": "<p>I’ve written and published an article, in which I describe how to create API test cases in <a href=\"https://www.getpostman.com/\">Postman</a> and then run them both within Postman as well as its command line companion Newman and finally export the collection from Postman and import it to BlazeMeter for cloud-based functional API testing.</p>\n\n<p>If you’re curious you can read the article <a href=\"https://www.blazemeter.com/blog/api-functional-testing-with-postman-newman-blazemeter\">on the BlazeMeter blog</a> or the <a href=\"https://dzone.com/articles/functional-api-testing-with-postman-newman-and-bla\">syndicated copy on DZone</a>.</p>\n\n<p><em>Disclaimer: This work was paid for by BlazeMeter.</em></p>\n",
			"date_published": "2018-06-05T21:09:42+02:00",
			"url": "https://lukasrosenstock.net/2018/06/05/ive-written-and.html"
		},
		
		{
			"id": "http://lukas.micro.blog/2018/05/08/as-promised-i.html",
	      	
			"content_html": "<p>As promised, I wrote an article about my experience at API the Docs Paris 2018. It’s <a href=\"https://blog.cloudobjects.io/api-documentation/events/2018/05/04/api-the-docs-paris/\">published on the CloudObjects blog</a>. Looking forward to your feedback!</p>\n",
			"date_published": "2018-05-08T10:35:29+02:00",
			"url": "https://lukasrosenstock.net/2018/05/08/as-promised-i.html"
		},
		
		{
			"id": "http://lukas.micro.blog/2018/04/25/im-on-a.html",
	      	
			"content_html": "<p>I’m on a train on my way back home from Paris, where I had three great days! I arrived on Monday and spent the afternoon exploring the city a bit, then met some of the conference attendees for dinner. On Tuesday there was the actual <a href=\"https://apithedocs.org/paris2018\">API the Docs</a> conference day at the beautiful Mozilla office. There were interesting speakers and more nice and interesting people to talk to. I’ve started writing a blog post about the event and the talks which I’ll publish on the CloudObjects Blog soon. This morning before leaving I went to see <a href=\"http://stationf.co/\">STATION F</a>, the world’s largest startup campus, located in Paris.</p>\n",
			"date_published": "2018-04-25T18:08:14+02:00",
			"url": "https://lukasrosenstock.net/2018/04/25/im-on-a.html"
		},
		
		{
			"id": "http://lukas.micro.blog/2018/04/15/im-happy-to.html",
	      	
			"content_html": "<p>I’m happy to announce that not only will I be attending <a href=\"https://apithedocs.org/paris2018\">API the Docs in Paris on April 24th</a>, but my talk proposal <a href=\"https://apithedocs.org/node/152\">“To SDK or not to SDK?”</a> has been accepted by the conference committee.\nCurrently I’m working on the talk and look very much forward to giving it in Paris soon.</p>\n",
			"date_published": "2018-04-15T16:57:07+02:00",
			"url": "https://lukasrosenstock.net/2018/04/15/im-happy-to.html"
		},
		
		{
			"id": "http://lukas.micro.blog/2018/03/07/after-long-consideration.html",
	      	
			"content_html": "<p>After long consideration, I decided to create a hosted Microblog on micro.blog. Now I need to set this thing up.</p>\n",
			"date_published": "2018-03-07T14:44:08+01:00",
			"url": "https://lukasrosenstock.net/2018/03/07/after-long-consideration.html"
		}
		
	]
}
